# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [1]:
# load %sql magic extension
%load_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///Movies.db

'Connected: @Movies.db'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [2]:
%%sql

SELECT * 
FROM sqlite_master

 * sqlite:///Movies.db
Done.

[('table', 'MOVIES', 'MOVIES', 2, 'CREATE TABLE MOVIES (\n    MID INTEGER PRIMARY KEY, \n    Mtitle TEXT NOT NULL, \n    Rating TEXT    \n)'),
 ('table', 'THEATRE', 'THEATRE', 3, 'CREATE TABLE THEATRE (\n    TID INTEGER PRIMARY KEY,\n    Tname TEXT NOT NULL,\n    Phone TEXT NULL,\n    Location TEXT NOT NULL \n)'),
 ('table', 'ARTIST', 'ARTIST', 4, 'CREATE TABLE ARTIST (\n    AID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'SHOW', 'SHOW', 5, 'CREATE TABLE SHOW (\n    SID INTEGER PRIMARY KEY,\n    MID INTEGER NOT NULL,\n    TID INTEGER NOT NULL,\n    STime TEXT NOT NULL,\n    FOREIGN KEY (MID) REFERENCES MOVIES (MID),\n    FOREIGN KEY (TID) REFERENCES THEATRE (TID)\n)'),
 ('table', 'CREDIT', 'CREDIT', 6, 'CREATE TABLE CREDIT (\n    CID INTEGER PRIMARY KEY,\n    CCode TEXT NOT NULL,\n    AID INTEGER NOT NULL, \n    MID INTEGER NOT NULL,\n    FOREIGN KEY (AID) REFERENCES ARTIST (AID),\n    FOREIGN KEY (MID) REFERENCES MOVIES (MID)\n\n)')]

In [3]:
%%sql

SELECT Mtitle AS MovieTitle, Tname AS TheatreName, STime AS Showtime
FROM SHOW
    JOIN MOVIES USING (MID)
    JOIN THEATRE USING (TID)
    LIMIT 15

 * sqlite:///Movies.db
Done.

[('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '5:10 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:00 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:05 PM'),
 ('Independence Day', 'Akarakian Theatres Moreno 4 Cinemas', '7:00 PM'),
 ('Associate, The', 'Cinema Star The Ultraplex 14', '4:40 PM'),
 ('Associate, The', 'Cinema Star The Ultraplex 14', '7:30 PM'),
 ('D3: The Mighty Ducks', 'Cinema Star The Ultraplex 14', '2:30 PM'),
 ('Dear God', 'Cinema Star The Ultraplex 14', '5:15 PM'),
 ('Dear God', 'Cinema Star The Ultraplex 14', '7:45 PM'),
 ('First Wives Club, The', 'Cinema Star The Ultraplex 14', '5:30 PM'),
 ('First Wives Club, The', 'Cinema Star The Ultraplex 14', '8:00 PM'),
 ('Ghost & The Darkness, The', 'Cinema Star The Ultraplex 14', '5:00 PM')]

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

In [4]:
%%sql

SELECT Mtitle AS MovieTitle, Tname AS TheatreName, STime AS Showtime
FROM SHOW
    JOIN MOVIES USING (MID)
    JOIN THEATRE USING (TID)
WHERE ShowTime > 7
LIMIT 15;

 * sqlite:///Movies.db
Done.

[('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:00 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:05 PM'),
 ('Independence Day', 'Akarakian Theatres Moreno 4 Cinemas', '7:00 PM'),
 ('Associate, The', 'Cinema Star The Ultraplex 14', '7:30 PM'),
 ('Dear God', 'Cinema Star The Ultraplex 14', '7:45 PM'),
 ('First Wives Club, The', 'Cinema Star The Ultraplex 14', '8:00 PM'),
 ('Ghost & The Darkness, The', 'Cinema Star The Ultraplex 14', '7:40 PM'),
 ('High School High', 'Cinema Star The Ultraplex 14', '8:30 PM'),
 ('Larger Than Life', 'Cinema Star The Ultraplex 14', '8:20 PM'),
 ('Mirror Has Two Faces, The', 'Cinema Star The Ultraplex 14', '7:45 PM'),
 ('Mirror Has Two Faces, The', 'Cinema Star The Ultraplex 14', '8:45 PM'),
 ('Ransom', 'Cinema Star The Ultraplex 14', '7:00 PM'),
 ('Ransom', 'Cinema Star The Ultraplex 14', '7:30 PM')]

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [5]:
%%sql

SELECT Mtitle AS MovieTitle, Name, MID, AID, Ccode
FROM CREDIT
    JOIN MOVIES USING (MID)
    JOIN ARTIST USING (AID)
WHERE Ccode = 'A'
LIMIT 15;

 * sqlite:///Movies.db
Done.

[('Associate, The', 'Austin Pendleton', 1, 1, 'A'),
 ('Associate, The', 'Bebe Neuwirth', 1, 2, 'A'),
 ('Associate, The', 'Dianne Wiest', 1, 3, 'A'),
 ('Associate, The', 'Eli Wallach', 1, 4, 'A'),
 ('Associate, The', 'Kenny Kerr', 1, 5, 'A'),
 ('Associate, The', 'Lainie Kazan', 1, 6, 'A'),
 ('Associate, The', 'Tim Daly', 1, 7, 'A'),
 ('Associate, The', 'Whoopi Goldberg', 1, 8, 'A'),
 ('Ghost & The Darkness, The', 'Bernard Hill', 2, 10, 'A'),
 ('Ghost & The Darkness, The', 'Brian McCardie', 2, 11, 'A'),
 ('Ghost & The Darkness, The', 'Emily Mortimer', 2, 12, 'A'),
 ('Ghost & The Darkness, The', 'Henry Cele', 2, 13, 'A'),
 ('Ghost & The Darkness, The', 'John Kani', 2, 14, 'A'),
 ('Ghost & The Darkness, The', 'Michael Douglas', 2, 15, 'A'),
 ('Ghost & The Darkness, The', 'Tom Wilkinson', 2, 16, 'A')]

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [6]:
%%sql

SELECT DISTINCT Name, AID, COUNT(MID) AS Number_of_movies
FROM CREDIT
    JOIN ARTIST USING (AID)
GROUP BY Name
LIMIT 15;

 * sqlite:///Movies.db
Done.

[('Aidan Quinn', 93, 1),
 ('Alan Rickman', 94, 1),
 ('Anna Paquin', 111, 1),
 ('Anthony Hopkins', 132, 1),
 ('Arlene Sanford', 147, 1),
 ('Austin Pendleton', 1, 1),
 ('Barbra Streisand', 60, 2),
 ('Barry Levinson', 82, 1),
 ('Baz Luhrmann', 105, 1),
 ('Bebe Neuwirth', 2, 1),
 ('Bernard Hill', 10, 1),
 ('Bette Midler', 44, 1),
 ('Bill Murray', 53, 2),
 ('Bill Pullman', 19, 1),
 ('Bill Smitrovich', 20, 1)]

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [7]:
%%sql

SELECT DISTINCT Name, AID, COUNT(MID) AS Number_of_movies
FROM CREDIT
    JOIN ARTIST USING (AID)
GROUP BY Name
HAVING Number_of_movies >= 2
LIMIT 15;

 * sqlite:///Movies.db
Done.

[('Barbra Streisand', 60, 2),
 ('Bill Murray', 53, 2),
 ('Campbell Scott', 106, 2),
 ('Diane Venora', 100, 2),
 ('Jada Pinkett', 117, 2),
 ('Minnie Driver', 77, 2),
 ('Rob Lieberman', 35, 2),
 ('Stanley Tucci', 109, 2),
 ('Vivica Fox', 28, 2)]

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.

In [8]:
%%sql

SELECT DISTINCT Name, COUNT((SELECT Ccode FROM ARTIST WHERE Ccode = 'A'))AS Actor_credits, COUNT((SELECT Ccode FROM ARTIST WHERE Ccode = 'D')) AS Director_credits, COUNT(Ccode) AS Act_Dir_credits
FROM ARTIST
    JOIN CREDIT USING (AID)
GROUP BY Name
HAVING Director_credits == 1
AND Actor_credits >0;

 * sqlite:///Movies.db
Done.

[('Barbra Streisand', 1, 1, 2),
 ('Campbell Scott', 1, 1, 2),
 ('Rob Lieberman', 1, 1, 2),
 ('Stanley Tucci', 1, 1, 2)]